StratifyLabs/StratifyOS-mcu-stm32/src/usb_otg_fs_dev.c
/* Copyright 2011-2018 Tyler Gilbert;
 * This file is part of Stratify OS.
 *
 * Stratify OS is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * Stratify OS is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with Stratify OS.  If not, see <http://www.gnu.org/licenses/>.
 *
 *
 */

#include <fcntl.h>
#include <mcu/usb.h>
#include <mcu/pio.h>
#include <cortexm/cortexm.h>
#include <usbd/types.h>
#include <mcu/core.h>
#include <mcu/debug.h>
#include <mcu/boot_debug.h>
#include <usbd/types.h>

#include "stm32_local.h"

#if MCU_USB_PORTS > 0

static void usb_connect(u32 port, u32 con);
static inline void usb_configure(const devfs_handle_t * handle, u32 cfg) MCU_ALWAYS_INLINE;
static inline void usb_set_address(const devfs_handle_t * handle, u32 addr) MCU_ALWAYS_INLINE;
static inline void usb_reset_endpoint(const devfs_handle_t * handle, u32 endpoint_num) MCU_ALWAYS_INLINE;
static inline void usb_enable_endpoint(const devfs_handle_t * handle, u32 endpoint_num) MCU_ALWAYS_INLINE;
static inline void usb_disable_endpoint(const devfs_handle_t * handle, u32 endpoint_num) MCU_ALWAYS_INLINE;
static inline void usb_stall_endpoint(const devfs_handle_t * handle, u32 endpoint_num) MCU_ALWAYS_INLINE;
static inline void usb_unstall_endpoint(const devfs_handle_t * handle, u32 endpoint_num) MCU_ALWAYS_INLINE;
static inline void usb_configure_endpoint(const devfs_handle_t * handle, u32 endpoint_num, u32 max_packet_size, u8 type) MCU_ALWAYS_INLINE;
static inline void usb_reset(const devfs_handle_t * handle);

typedef struct MCU_PACK {
    PCD_HandleTypeDef hal_handle;
    mcu_event_handler_t write[DEV_USB_LOGICAL_ENDPOINT_COUNT];
    mcu_event_handler_t read[DEV_USB_LOGICAL_ENDPOINT_COUNT];
    u16 rx_count[DEV_USB_LOGICAL_ENDPOINT_COUNT];
    u16 rx_buffer_offset[DEV_USB_LOGICAL_ENDPOINT_COUNT];
    u16 rx_buffer_used;
    volatile u32 write_pending;
    volatile u32 read_ready;
    mcu_event_handler_t special_event_handler;
    u8 ref_count;
    u8 connected;
} usb_local_t;

static usb_local_t usb_local[MCU_USB_PORTS] MCU_SYS_MEM;

static USB_OTG_GlobalTypeDef * const usb_regs_table[MCU_USB_PORTS] = MCU_USB_REGS;
static u8 const usb_irqs[MCU_USB_PORTS] = MCU_USB_IRQS;
static void clear_callbacks();

void clear_callbacks(int port){
    memset(usb_local[port].write, 0, DEV_USB_LOGICAL_ENDPOINT_COUNT * sizeof(mcu_event_handler_t));
    memset(usb_local[port].read, 0, DEV_USB_LOGICAL_ENDPOINT_COUNT * sizeof(mcu_event_handler_t));
    memset(&usb_local[port].special_event_handler, 0, sizeof(mcu_event_handler_t));
    memset(usb_local[port].rx_buffer_offset, 0, DEV_USB_LOGICAL_ENDPOINT_COUNT * sizeof(u16));
    usb_local[port].rx_buffer_used = 0;
}

DEVFS_MCU_DRIVER_IOCTL_FUNCTION(usb, USB_VERSION, USB_IOC_IDENT_CHAR, I_MCU_TOTAL + I_USB_TOTAL, mcu_usb_isconnected)


int mcu_usb_open(const devfs_handle_t * handle){
    u32 port = handle->port;
    if ( usb_local[port].ref_count == 0 ){
        //Set callbacks to NULL
        usb_local[port].connected = 0;
        clear_callbacks(handle->port);
        usb_local[port].hal_handle.Instance = usb_regs_table[port];

        if( port == 0 ){
#if MCU_USB_API > 0
                __HAL_RCC_USB_OTG_FS_CLK_ENABLE();
#else
                __HAL_RCC_USB_CLK_ENABLE();
#endif
        } else {
#if MCU_USB_PORTS > 1
#if defined __HAL_RCC_OTGPHYC_CLK_ENABLE
            __HAL_RCC_OTGPHYC_CLK_ENABLE();
#endif
            __HAL_RCC_USB_OTG_HS_CLK_ENABLE();
            __HAL_RCC_USB_OTG_HS_ULPI_CLK_ENABLE();
#endif
        }
        cortexm_enable_irq(usb_irqs[port]);  //Enable USB IRQ
    }
    usb_local[port].ref_count++;
    return 0;
}

int mcu_usb_close(const devfs_handle_t * handle){
    u32 port = handle->port;
    if ( usb_local[port].ref_count > 0 ){
        if ( usb_local[port].ref_count == 1 ){
            HAL_PCD_Stop(&usb_local[port].hal_handle);
            cortexm_disable_irq(usb_irqs[port]);  //Disable the USB interrupt
            usb_local[port].hal_handle.Instance = 0;
            if( port == 0 ){
#if MCU_USB_API > 0
                __HAL_RCC_USB_OTG_FS_CLK_DISABLE();
#else
                __HAL_RCC_USB_CLK_DISABLE();
#endif
            } else {
#if MCU_USB_PORTS > 1
#if defined __HAL_RCC_OTGPHYC_CLK_DISABLE
                __HAL_RCC_OTGPHYC_CLK_DISABLE();
#endif
                __HAL_RCC_USB_OTG_HS_CLK_DISABLE();
                __HAL_RCC_USB_OTG_HS_ULPI_CLK_DISABLE();
#endif
            }
        }
        usb_local[port].ref_count--;
    }
    return 0;
}

int mcu_usb_getinfo(const devfs_handle_t * handle, void * ctl){
    usb_info_t * info = ctl;

    info->o_flags = 0;
    info->o_events = 0;
    return 0;
}

int mcu_usb_setattr(const devfs_handle_t * handle, void * ctl){
    u32 port = handle->port;

    const usb_attr_t * attr = mcu_select_attr(handle, ctl);
    if( attr == 0 ){ return SYSFS_SET_RETURN(ENOSYS); }
    u32 o_flags = attr->o_flags;


    if( o_flags & USB_FLAG_SET_DEVICE ){
        //Start the USB clock
        int result;
        mcu_core_setusbclock(attr->freq);

        usb_local[port].read_ready = 0;
        usb_local[port].write_pending = 0;


        result = mcu_set_pin_assignment(
                    &(attr->pin_assignment),
                    MCU_CONFIG_PIN_ASSIGNMENT(usb_config_t, handle),
                    MCU_PIN_ASSIGNMENT_COUNT(usb_pin_assignment_t),
                    CORE_PERIPH_USB, port, 0, 0, 0);

        if( result < 0 ){ return result; }

#if defined STM32L4
        if(__HAL_RCC_PWR_IS_CLK_DISABLED()){
          __HAL_RCC_PWR_CLK_ENABLE();
          HAL_PWREx_EnableVddUSB();
          __HAL_RCC_PWR_CLK_DISABLE();
        } else {
          HAL_PWREx_EnableVddUSB();
        }
#endif

        if( port == 0 ){
            usb_local[port].hal_handle.Init.dev_endpoints = 6;
            usb_local[port].hal_handle.Init.speed = PCD_SPEED_FULL;
            usb_local[port].hal_handle.Init.phy_itface = PCD_PHY_EMBEDDED;
        } else {
#if MCU_USB_PORTS > 1
            usb_local[port].hal_handle.Init.dev_endpoints = DEV_USB_LOGICAL_ENDPOINT_COUNT;
            if( o_flags & USB_FLAG_IS_HIGH_SPEED ){
                usb_local[port].hal_handle.Init.speed = USB_OTG_SPEED_HIGH;
            } else {
                usb_local[port].hal_handle.Init.speed = USB_OTG_SPEED_HIGH_IN_FULL;
            }

            //Need a flag to check for HW interface
            usb_local[port].hal_handle.Init.phy_itface = USB_OTG_HS_EMBEDDED_PHY;
#endif
        }
        usb_local[port].hal_handle.Init.dma_enable = DISABLE;
        usb_local[port].hal_handle.Init.ep0_mps = DEP0CTL_MPS_64;
        if ( attr->max_packet_size <= 8 ){
            usb_local[port].hal_handle.Init.ep0_mps = DEP0CTL_MPS_8;
        } else if ( attr->max_packet_size <= 16 ){
            usb_local[port].hal_handle.Init.ep0_mps = DEP0CTL_MPS_16;
        } else if ( attr->max_packet_size <= 32 ){
            usb_local[port].hal_handle.Init.ep0_mps = DEP0CTL_MPS_32;
        }

        usb_local[port].hal_handle.Init.Sof_enable = DISABLE;
        usb_local[port].hal_handle.Init.low_power_enable = DISABLE;
        usb_local[port].hal_handle.Init.lpm_enable = DISABLE;
        usb_local[port].hal_handle.Init.battery_charging_enable = DISABLE;

#if MCU_USB_API > 0
        usb_local[port].hal_handle.Init.vbus_sensing_enable = DISABLE;
        usb_local[port].hal_handle.Init.use_dedicated_ep1 = DISABLE;
        usb_local[port].hal_handle.Init.use_external_vbus = DISABLE;

        if( o_flags & USB_FLAG_IS_VBUS_SENSING_ENABLED ){
            usb_local[port].hal_handle.Init.vbus_sensing_enable = ENABLE;
        }
#endif

        if( o_flags & USB_FLAG_IS_SOF_ENABLED ){
            usb_local[port].hal_handle.Init.Sof_enable = ENABLE;
        }

