StratifyLabs/StratifyOS-mcu-stm32/src/usb_otg_fs_dev.c
        if( o_flags & USB_FLAG_IS_LOW_POWER_MODE_ENABLED ){
            usb_local[port].hal_handle.Init.lpm_enable = ENABLE;
        }

        if( o_flags & USB_FLAG_IS_BATTERY_CHARGING_ENABLED ){
            usb_local[port].hal_handle.Init.battery_charging_enable = ENABLE;
        }

        if( HAL_PCD_Init(&usb_local[port].hal_handle) != HAL_OK ){
            return SYSFS_SET_RETURN(EIO);
        }

#if MCU_USB_API > 0
        int i;
        HAL_PCDEx_SetRxFiFo(&usb_local[port].hal_handle, attr->rx_fifo_word_size);  //size is in 32-bit words for all fifo - 512
        for(i=0; i < USB_TX_FIFO_WORD_SIZE_COUNT; i++){
            if( attr->tx_fifo_word_size[i] > 0 ){
                HAL_PCDEx_SetTxFiFo(&usb_local[port].hal_handle, i, attr->tx_fifo_word_size[i]);
            }
        }
#else

#if 1
        HAL_PCDEx_PMAConfig(&usb_local[port].hal_handle, 0x00 , PCD_SNG_BUF, 0x18);  //why do we start 24 bytes in?
        HAL_PCDEx_PMAConfig(&usb_local[port].hal_handle, 0x80 , PCD_SNG_BUF, 0x18+64); //64 bytes for 00

        HAL_PCDEx_PMAConfig(&usb_local[port].hal_handle, 0x81 , PCD_SNG_BUF, 0x18+64+64); //interrupt in
        HAL_PCDEx_PMAConfig(&usb_local[port].hal_handle, 0x82 , PCD_SNG_BUF, 0x18+64+64+64); //bulk input -- sending data to computer
        HAL_PCDEx_PMAConfig(&usb_local[port].hal_handle, 0x02 , PCD_SNG_BUF, 0x18+64+64+64+64); //bulk output -- receiving data from computer
#else
        HAL_PCDEx_PMAConfig(&usb_local[port].hal_handle , 0x00 , PCD_SNG_BUF, 0x18);
        HAL_PCDEx_PMAConfig(&usb_local[port].hal_handle , 0x80 , PCD_SNG_BUF, 0x58);
        HAL_PCDEx_PMAConfig(&usb_local[port].hal_handle , 0x81 , PCD_SNG_BUF, 0xC0);
        HAL_PCDEx_PMAConfig(&usb_local[port].hal_handle , 0x01 , PCD_SNG_BUF, 0x110);
        HAL_PCDEx_PMAConfig(&usb_local[port].hal_handle , 0x82 , PCD_SNG_BUF, 0x100);
#endif

#endif
    }


    if( o_flags & USB_FLAG_RESET ){ usb_reset(handle); }
    if( o_flags & USB_FLAG_ATTACH ){ usb_connect(port, 1); }
    if( o_flags & USB_FLAG_DETACH ){ usb_connect(port, 0); }
    if( o_flags & USB_FLAG_CONFIGURE ){ usb_configure(handle, 1); }
    if( o_flags & USB_FLAG_UNCONFIGURE ){ usb_configure(handle, 0); }

    if( o_flags & USB_FLAG_SET_ADDRESS ){
        usb_set_address(handle, attr->address);
    }

    if( o_flags & USB_FLAG_RESET_ENDPOINT ){
        usb_reset_endpoint(handle, attr->address);
    }

    if( o_flags & USB_FLAG_ENABLE_ENDPOINT ){
        usb_enable_endpoint(handle, attr->address);
    }

    if( o_flags & USB_FLAG_DISABLE_ENDPOINT ){
        usb_disable_endpoint(handle, attr->address);
    }

    if( o_flags & USB_FLAG_STALL_ENDPOINT ){
        usb_stall_endpoint(handle, attr->address);
    }

    if( o_flags & USB_FLAG_UNSTALL_ENDPOINT ){
        usb_unstall_endpoint(handle, attr->address);
    }

    if( o_flags & USB_FLAG_CONFIGURE_ENDPOINT ){
        usb_configure_endpoint(handle, attr->address, attr->max_packet_size, attr->type);
    }

    return 0;
}

void usb_connect(u32 port, u32 con){
    if( con ){
        HAL_PCD_Start(&usb_local[port].hal_handle);
    } else {
        HAL_PCD_Stop(&usb_local[port].hal_handle);
    }
}

int mcu_usb_setaction(const devfs_handle_t * handle, void * ctl){
    u32 port = handle->port;
    mcu_action_t * action = (mcu_action_t*)ctl;
    int log_ep;
    int ret = -1;

    //cortexm_set_irq_prio(USB_IRQn, action->prio);
    log_ep = action->channel & ~0x80;

    if( action->o_events &
            (MCU_EVENT_FLAG_POWER|MCU_EVENT_FLAG_SUSPEND|MCU_EVENT_FLAG_STALL|MCU_EVENT_FLAG_SOF|MCU_EVENT_FLAG_WAKEUP)
            ){
        usb_local[port].special_event_handler = action->handler;
        return 0;
    }

    if( action->channel & 0x80 ){
        if( (action->handler.callback == 0) && (action->o_events & MCU_EVENT_FLAG_WRITE_COMPLETE) ){
            usb_local[port].write_pending &= ~(1<<log_ep);
            mcu_execute_event_handler(&(usb_local[port].write[log_ep]), MCU_EVENT_FLAG_CANCELED, 0);
        }
    } else {
        if( (action->handler.callback == 0) && (action->o_events & MCU_EVENT_FLAG_DATA_READY) ){
            usb_local[port].read_ready |= (1<<log_ep);
            mcu_execute_event_handler(&(usb_local[port].read[log_ep]), MCU_EVENT_FLAG_CANCELED, 0);
        }
    }


    if ( (log_ep < DEV_USB_LOGICAL_ENDPOINT_COUNT)  ){
        if( action->o_events & MCU_EVENT_FLAG_DATA_READY ){
            //cortexm_enable_interrupts();
            if( cortexm_validate_callback(action->handler.callback) < 0 ){
                return SYSFS_SET_RETURN(EPERM);
            }

            if( log_ep == 0 ){
                if( action->o_events & MCU_EVENT_FLAG_SETUP ){
                    usb_local[port].read[log_ep] = action->handler;
                } else {
                    return SYSFS_SET_RETURN(EINVAL);
                }
            } else {
                usb_local[port].read[log_ep] = action->handler;
            }
            ret = 0;
        }

        if( action->o_events & MCU_EVENT_FLAG_WRITE_COMPLETE ){
            if( cortexm_validate_callback(action->handler.callback) < 0 ){
                return SYSFS_SET_RETURN(EPERM);
            }

            if( log_ep == 0 ){
                if( action->o_events & MCU_EVENT_FLAG_SETUP ){
                    usb_local[port].write[log_ep] = action->handler;
                } else {
                    return SYSFS_SET_RETURN(EINVAL);
                }
            } else {
                usb_local[port].write[log_ep] = action->handler;
            }
            ret = 0;
        }
    }

    if( ret < 0 ){
        ret = SYSFS_SET_RETURN(EINVAL);
    }
    return ret;
}

int mcu_usb_read(const devfs_handle_t * handle, devfs_async_t * rop){
    u32 port = handle->port;
    int ret;
    int loc = rop->loc;

    if ( loc > (DEV_USB_LOGICAL_ENDPOINT_COUNT-1) ){
        return SYSFS_SET_RETURN(EINVAL);
    }

    if( usb_local[port].read[loc].callback ){
        return SYSFS_SET_RETURN(EBUSY);
    }

    usb_local[port].read[loc] = rop->handler;

