StratifyLabs/StratifyOS-mcu-stm32/src/usb_otg_fs_dev.c
    //Synchronous read (only if data is ready) otherwise 0 is returned
    if ( usb_local[port].read_ready & (1<<loc) ){
        usb_local[port].read[loc].callback = 0;
        ret = mcu_usb_root_read_endpoint(handle, loc, rop->buf);
        if( ret == 0 ){
            return SYSFS_SET_RETURN(EAGAIN);
        }
    } else {
        rop->nbyte = 0;
        if ( !(rop->flags & O_NONBLOCK) ){
            //If this is a blocking call, set the callback and context
            if( cortexm_validate_callback(rop->handler.callback) < 0 ){
                usb_local[port].read[loc].callback = 0;
                return SYSFS_SET_RETURN(EPERM);
            }
            ret = 0;
        } else {
            usb_local[port].read[loc].callback = 0;
            return SYSFS_SET_RETURN(EAGAIN);
        }
    }

    return ret;
}

int mcu_usb_write(const devfs_handle_t * handle, devfs_async_t * wop){
    //Asynchronous write
    u32 port = handle->port;
    int ep;
    int loc = wop->loc;
    int bytes_written;

    ep = (loc & 0x7F);

    if ( ep > (DEV_USB_LOGICAL_ENDPOINT_COUNT-1) ){
        return SYSFS_SET_RETURN(EINVAL);
    }

    if ( usb_local[port].write[ep].callback ){
        return SYSFS_SET_RETURN(EBUSY);
    }

    if( cortexm_validate_callback(wop->handler.callback) < 0 ){
        return SYSFS_SET_RETURN(EPERM);
    }

    usb_local[port].write[ep] = wop->handler;
    usb_local[port].write_pending |= (1<<ep);

    bytes_written = mcu_usb_root_write_endpoint(handle, loc, wop->buf, wop->nbyte);

    if ( bytes_written < 0 ){
        usb_disable_endpoint(handle, loc );
        usb_reset_endpoint(handle, loc );
        usb_enable_endpoint(handle, loc );
    }

    if( bytes_written != 0 ){
        usb_local[port].write[ep].callback = 0;
        usb_local[port].write_pending &= ~(1<<ep);
    }

    return bytes_written;
}


void usb_reset(const devfs_handle_t * handle){

}

void usb_wakeup(int port){

}

void usb_set_address(const devfs_handle_t * handle, u32 addr){
    HAL_PCD_SetAddress(&usb_local[handle->port].hal_handle, addr);
}

void usb_configure(const devfs_handle_t * handle, u32 cfg){
    usb_local[handle->port].connected = 1;
}

void usb_configure_endpoint(const devfs_handle_t * handle, u32 endpoint_num, u32 max_packet_size, u8 type){
    u32 port = handle->port;
    const stm32_config_t * stm32_config = mcu_board_config.arch_config;

    HAL_PCD_EP_Open(&usb_local[handle->port].hal_handle, endpoint_num, max_packet_size, type & EP_TYPE_MSK);

    if( (endpoint_num & 0x80) == 0 ){
        void * dest_buffer;

        usb_local[port].rx_buffer_offset[endpoint_num] = usb_local[port].rx_buffer_used;
        usb_local[port].rx_buffer_used += (max_packet_size*2);
        if( usb_local[port].rx_buffer_used > stm32_config->usb_rx_buffer_size ){
            //this is a fatal error
            mcu_board_execute_event_handler(MCU_BOARD_CONFIG_EVENT_ROOT_FATAL, "usbbuf");
        }

        dest_buffer = stm32_config->usb_rx_buffer +
                usb_local[port].rx_buffer_offset[endpoint_num] +
                max_packet_size;

        HAL_PCD_EP_Receive(&usb_local[port].hal_handle, endpoint_num, dest_buffer, max_packet_size);

    }
}

void usb_enable_endpoint(const devfs_handle_t * handle, u32 endpoint_num){
}

void usb_disable_endpoint(const devfs_handle_t * handle, u32 endpoint_num){
    HAL_PCD_EP_Close(&usb_local[handle->port].hal_handle, endpoint_num);
}

void usb_reset_endpoint(const devfs_handle_t * handle, u32 endpoint_num){
}

void usb_stall_endpoint(const devfs_handle_t * handle, u32 endpoint_num){
    HAL_PCD_EP_SetStall(&usb_local[handle->port].hal_handle, endpoint_num);
}

void usb_unstall_endpoint(const devfs_handle_t * handle, u32 endpoint_num){
    HAL_PCD_EP_ClrStall(&usb_local[handle->port].hal_handle, endpoint_num);
}

int mcu_usb_isconnected(const devfs_handle_t * handle, void * ctl){
    return usb_local[handle->port].connected;
}

void usb_clr_ep_buf(const devfs_handle_t * handle, u32 endpoint_num){

}

int mcu_usb_root_read_endpoint(const devfs_handle_t * handle, u32 endpoint_num, void * dest){
    u32 port = handle->port;
    const stm32_config_t * stm32_config = mcu_board_config.arch_config;
    void * src_buffer;
    u8 epnum;
    epnum = endpoint_num & 0x7f;

    if( usb_local[port].read_ready & (1<<epnum) ){
        usb_local[port].read_ready &= ~(1<<epnum);
        src_buffer = stm32_config->usb_rx_buffer + usb_local[port].rx_buffer_offset[epnum];
        //data is copied from fifo to buffer during the interrupt
        memcpy(dest, src_buffer, usb_local[port].rx_count[epnum]);
        return usb_local[port].rx_count[epnum];
    }

    return -1;
}

int mcu_usb_root_write_endpoint(const devfs_handle_t * handle, u32 endpoint_num, const void * src, u32 size){
    int ret;

#if MCU_USB_API > 0
    int logical_endpoint = endpoint_num & 0x7f;
    int type = usb_local[handle->port].hal_handle.IN_ep[logical_endpoint].type;
    if( type == EP_TYPE_ISOC ){
        static int count = 0;
        count++;
        if( count % 1000 == 0 ){
            //mcu_debug_printf("iso %d\n", count);
        }
        //check to see if the packet will fit in the FIFO
        //if the packet won't fit, return EBUSY
        USB_OTG_GlobalTypeDef * USBx = usb_local[handle->port].hal_handle.Instance;
        int available = (USBx_INEP(logical_endpoint)->DTXFSTS & USB_OTG_DTXFSTS_INEPTFSAV);
        if( (available * 4) < size ){
            //mcu_debug_printf("busy\n");
            return SYSFS_SET_RETURN(EBUSY);
        }
    }
#endif

    ret = HAL_PCD_EP_Transmit(&usb_local[handle->port].hal_handle, endpoint_num, (void*)src, size);
    if( ret == HAL_OK ){
#if 0
        if( type == EP_TYPE_ISOC ){
            return size;
        }
#endif
        return 0;
    }

    return SYSFS_SET_RETURN(EIO);
}


void HAL_PCD_SetupStageCallback(PCD_HandleTypeDef *hpcd){
    usb_local_t * usb = (usb_local_t *)hpcd;
    //a setup packet has been received
    const stm32_config_t * stm32_config = mcu_board_config.arch_config;
    usb_event_t event;
    event.epnum = 0;
    void * dest_buffer;
    usbd_setup_packet_t * setup = (usbd_setup_packet_t *)&hpcd->Setup;

    //Setup data is in hpcd->Setup buffer at this point

    //copy setup data to ep0 data buffer
    usb->read_ready |= (1<<0);
    dest_buffer = stm32_config->usb_rx_buffer + usb->rx_buffer_offset[0];
    usb->rx_count[0] = sizeof(usbd_setup_packet_t);
    memcpy(dest_buffer, hpcd->Setup, usb->rx_count[0]);

    mcu_execute_event_handler(usb->read + 0, MCU_EVENT_FLAG_SETUP, &event);

    //prepare EP zero for receiving out data

    if( (setup->bmRequestType.bitmap_t.dir == USBD_REQUEST_TYPE_DIRECTION_HOST_TO_DEVICE) && (setup->wLength > 0) ){
        HAL_PCD_EP_Receive(hpcd, 0, stm32_config->usb_rx_buffer, setup->wLength);
    }

