StratifyLabs/StratifyOS-mcu-stm32/src/usb_otg_fs_dev.c
}

void HAL_PCD_DataOutStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum){
    usb_local_t * usb = (usb_local_t *)hpcd;
    //data has already been received and is stored in buffer specified by HAL_PCD_EP_Receive
    const stm32_config_t * stm32_config = mcu_board_config.arch_config;
    usb_event_t event;
    event.epnum = epnum;
    u16 count;
    void * src_buffer;
    void * dest_buffer;



    //set read ready flag
    usb->read_ready |= (1<<epnum);
    count = HAL_PCD_EP_GetRxCount(&usb->hal_handle, epnum);

    dest_buffer = stm32_config->usb_rx_buffer + usb->rx_buffer_offset[epnum];
    src_buffer = dest_buffer + hpcd->OUT_ep[epnum].maxpacket;

    memcpy(dest_buffer, src_buffer, count);
    usb->rx_count[epnum] = count;

    mcu_execute_event_handler(usb->read + epnum, MCU_EVENT_FLAG_DATA_READY, &event);

    //prepare to receive the next packet in the local buffer
    if( epnum != 0 ){
        HAL_PCD_EP_Receive(hpcd, epnum, src_buffer, hpcd->OUT_ep[epnum].maxpacket);
    }

}

void HAL_PCD_DataInStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum){
    usb_local_t * usb = (usb_local_t *)hpcd;
    u8 logical_ep = epnum & 0x7f;
    usb_event_t event;
    event.epnum = epnum;

    usb->write_pending &= ~(1<<logical_ep);

    mcu_execute_event_handler(usb->write + logical_ep, MCU_EVENT_FLAG_WRITE_COMPLETE, &event);

    if( logical_ep == 0 ){
//#if MCU_USB_API == 0
        //only proceed it DataIn tx'd more than zero bytes
        if( hpcd->IN_ep[0].xfer_count == 0 ){
            return;
        }
//#endif
        //ep 0 data in complete
        //prepare EP0 for next setup packet
        HAL_PCD_EP_Receive(hpcd, 0, 0, 0);

    }



}

void HAL_PCD_SOFCallback(PCD_HandleTypeDef *hpcd){

}

void HAL_PCD_ResetCallback(PCD_HandleTypeDef *hpcd){
    int i;
    usb_local_t * usb = (usb_local_t *)hpcd;
    u32 mps = mcu_board_config.usb_max_packet_zero;

    usb->rx_buffer_used = mps;
    for(i=0; i < DEV_USB_LOGICAL_ENDPOINT_COUNT; i++){
        usb->rx_buffer_offset[i] = 0;
    }

    HAL_PCD_EP_Open(hpcd, 0x00, mps, EP_TYPE_CTRL);
    HAL_PCD_EP_Open(hpcd, 0x80, mps, EP_TYPE_CTRL);
}

void HAL_PCD_SuspendCallback(PCD_HandleTypeDef *hpcd){

#if MCU_USB_API > 0
    __HAL_PCD_GATE_PHYCLOCK(hpcd);
#endif

}

void HAL_PCD_ResumeCallback(PCD_HandleTypeDef *hpcd){

}

void HAL_PCD_ISOINIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum){

    //epnum value passed is not valid -- need to find it
    int i;
    for(i=1; i < DEV_USB_LOGICAL_ENDPOINT_COUNT; i++){
        if( hpcd->IN_ep[i].type == EP_TYPE_ISOC ){

            epnum = 0x80 | i;
            u8 logical_ep = epnum & 0x7F;

            if( HAL_PCD_EP_Close(hpcd, epnum) != HAL_OK ){
                //mcu_debug_root_printf("close failed\n");
            }
            if( HAL_PCD_EP_Open(hpcd, epnum, hpcd->IN_ep[logical_ep].maxpacket, EP_TYPE_ISOC) != HAL_OK ){
                //mcu_debug_root_printf("open failed\n");
            }
            if( HAL_PCD_EP_Flush(hpcd, epnum) != HAL_OK ){
                //mcu_debug_root_printf("flush failed\n");
            }
        }

    }
}

void HAL_PCD_ISOOUTIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum){
    //mcu_debug_root_printf("Iso out\n");
}

void HAL_PCD_ConnectCallback(PCD_HandleTypeDef *hpcd){
    usb_local_t * usb = (usb_local_t *)hpcd;
    usb->connected = 1;

    //execute special event handler
}

void HAL_PCD_DisconnectCallback(PCD_HandleTypeDef *hpcd){
    usb_local_t * usb = (usb_local_t *)hpcd;
    usb->connected = 0;

}

void mcu_core_otg_fs_isr(){
    HAL_PCD_IRQHandler(&usb_local[0].hal_handle);
}

#if MCU_USB_PORTS > 1
void mcu_core_otg_hs_isr(){
    HAL_PCD_IRQHandler(&usb_local[1].hal_handle);
}
#endif

#endif








